//Створити масив, довжину та елементи якого задає користувач.
//Відсортувати масив за зростанням.
//Видалити елементи з масиву з 2 по 4 (включно!).
//У міру змін виводити вміст масиву на сторінку.


let array = prompt("Введить кількість цифр масиву та їх значення");

const newArray = array.split('');
console.log('Масив, який ввів користувач: ' + newArray);

const sortNewArray = newArray.sort((a, b) => a - b);
console.log('Відсортований масив за зростанням: ' + sortNewArray);

sortNewArray.splice(2, 3);
console.log('З масиву видалено елементи з 2 по 4 (включно!) ' + sortNewArray);





